'''Створіть масив зі строками, які будуть складатися з чисел, які розділені
 комою. Наприклад: [”1,2,3,4”, ”1,2,3,4,50” ”qwerty1,2,3”]
Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток
і вивести “Не можу це зробити!”
Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”'''

my_list = ['2, 3,4,5,6', '20,11,17,19,33', 'qbuyty1,2,3']
def sum_my_list(i):
    result = []
    for lists in i:
        try:
            my_list1 = list(map(int, lists.split(',')))
            result.append(sum(my_list1))
        except ValueError:
            result.append('Не можу це зробити')
    return result
print(sum_my_list(my_list))