#Порахувати кількість унікальних символів в строці. Якщо їх більше 10 - вивести в консоль True, інакше - False.
#Строку отримати за допомогою функції input()
string = input("Input your string:")
if len(set(string)) >= 10:
    print(True)
else:
    print(False)

#Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є літера "h" (враховуються як великі так і маленькі).
#Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".
first_string = ""
while "h" not in first_string.lower():
    first_string = input("Введіть ваше речення:")
print("Perfect")


# Напишіть код, який свормує новий list (наприклад lst2), який містить лише змінні типу стрінг, які присутні в lst1.
# Данні в лісті можуть бути будь якими
lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
lst2 = []
for i in lst1:
    if isinstance(i, str):
        lst2.append(i)
print(lst2)

#Є ліст з числами, порахуйте сумму усіх ПАРНИХ чисел в цьому лісті
#Є ліст з числами, порахуйте сумму усіх ПАРНИХ чисел в цьому лісті

list = [1, 2, 3, 4, 5, 6, 7, 8]
result = 0
for i in list:
    if i%2==0:
        result = result + i 
        print(result)